{
  "trails": [
    {
      "id": 0,
      "name": "Half Dome",
      "coords": {
        "latitude": 37.7459,
        "longitude": -119.5332
      },
      "distance": "14.2 miles roundtrip",
      "difficulty": "strenuous",
      "familyFriendly": false,
      "campground": false,
      "elevationGain": "4800 ft",
      "whyVisit": "Half Dome is the ultimate Yosemite day hike - the one you can't die without doing, and the one you're most likely to die while doing. It's got 900 feet (300 meters) worth of spectacular waterfalls at the bottom if you take the Mist Trail route; bigger-than-life panoramic vistas at the top; and a knee-knocking, hand-clamming cable ascent that will test your courage, your strength, and the tread on your shoes.",
      "description": "Rising nearly 5,000 feet above Yosemite Valley and 8,800 feet above sea level, Half Dome is a Yosemite icon and a great challenge to many hikers. Despite an 1865 report declaring that it was perfectly inaccessible, being probably the only one of the prominent points about the Yosemite which never has been, and never will be, trodden by human foot, George Anderson reached the summit in 1875, in the process laying the predecessor to today's cable route. Today, thousands of people reach the summit. For most, it is an exciting, arduous hike; for a few, it becomes more of an adventure than they wanted. Indeed, park rangers assist hundreds of people on the Half Dome trail every summer. Most of these emergencies could have been prevented... read on to learn how. Much of the hike to Half Dome is an adventure into Wilderness, and, while there is nothing you can do to guarantee your safety, below you will find some tips to reduce your risk and have a safer, more enjoyable hike.",
      "hazards": "The approach to Half Dome is steep and difficult. The last 400 vertical feet (130 meters) up the eastern slope are so sheer that Yosemite staff have installed cables for you to cling to as you pull yourself up. Without the cables or serious mountaineering gear, the ascent would be impossible. You'll find poles holding the cables up every ten feet or so along the slope, with a 2x4 attached to each set of poles at ground level so you can rest and contemplate your mortality before you attack the next section of cable. Get an early start, wear grippy shoes, and make sure you bring gloves if you are planning to summit Half Dome. Your hands will thank you!",
      "permit": "http://www.recreation.gov/permits/Cables_On_Half_Dome/r/wildernessAreaDetails.do?page=detail&contractCode=NRSO&parkId=79064",
      "trailhead": "Happy Isles (shuttle stop #16)",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/halfDome.jpeg",
      "estTime": "10-14 hours",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 5,
      "crowdFactor": 4,
      "park": "Yosemite National Park"
    },
    {
      "id": 1,
      "name": "4-Mile Trail",
      "coords": {
        "latitude": 37.73,
        "longitude": -119.6
      },
      "distance": " 4.7 miles one-way, 9.4 miles roundtrip",
      "difficulty": "difficult",
      "difficultyExplained": "Call it a 4 out of 10 going down and 7 out of 10 going up. The trail is wide and smooth, and not nearly so steep as Upper Yosemite Falls, whose own valley-floor-to-valley-rim trail is a mile shorter. By the time you finish the second set of switchbacks on the way up, though, you'll know you've been on a hike",
      "familyFriendly": false,
      "elevationGain": "3200 ft",
      "campground": false,
      "whyVisit": "Because this is where Yosemite Falls gives you the full monty. And if you hike it from bottom to top, you can buy yourself an ice cream at trail's end",
      "description": "There may be no better way to see what's so fabulous about Yosemite Valley than to hike the Four-Mile Trail, which climbs from the valley floor near the Swinging Bridge to the south valley rim at Glacier Point (or vice versa, or both, depending on your inclination). This hike offers great views of most of the landmarks that Yosemite Valley's famous for, and all from angles you're not used to seeing on postcards. It's a trail that connects Yosemite's two most popular spots - Yosemite Valley and Glacier Point - so it will have lots of hikers. There are memorable views around nearly every corner, though, so people won't be piling up at any particular spot.",
      "hazards": "Start your hike early; this trail can become very hot mid-day. By starting as early as possible, you will be able to spend more of the hike in shade and less in the sun. Stay on the trail and resist the temptation to cut switchbacks. Cutting switchbacks is illegal, and there are many drop-offs and ledges hidden by brush.Sprained ankles are common on this trail. It is partially paved and has loose sand on top, which makes for slippery footing in places.",
      "permit": "none",
      "trailhead": "Four Mile Trailhead along Southside Drive in Yosemite Valley",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/4-mile-trail.jpg",
      "estTime": "3-4 hours one way, 6-8 hours roundtrip",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 5,
      "crowdFactor": 4,
      "park": "Yosemite National Park"
    },
    {
      "id": 2,
      "name": "Clouds Rest Trail",
      "coords": {
        "latitude": 37.7677027,
        "longitude": -119.489327
      },
      "distance": "14.5 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "elevationGain": "2800 ft",
      "campground": false,
      "whyVisit": "To take in one of Yosemite's most stunning and wide-ranging 360-degree panoramic views, stretching from Hawaii in the west to Nebraska in the east. Or thereabouts. You can definitely see a lot of stuff from here.",
      "description": "TThis hike is all about the destination, from which you'll have striking views in every direction, including, perhaps most gripping of all, straight down. Turn a complete circle and you'll be able to see any number of Yosemite landmarks, including Tenaya Lake, Half Dome, Mt. Hoffman, Sentinel Dome, North Dome, and bits of Cathedral Rocks and El Capitan, plus Merced Lake and dozens of peaks you probably won't be able to name.",
      "hazards": "The top of Clouds Rest is a narrow ridge with a long, sheer dropoff on the north side (the side you can see from the Tioga Road). The dropoff to the south is less extreme, but it wouldn't require special talent to wind up just as thoroughly and symmetrically dead by falling off that side. It's best to visit Clouds Rest sober and during dry weather.",
      "permit": "none",
      "trailhead": "Sunrise Lakes Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/cloudsRest.jpg",
      "estTime": "3-4 hours one way, 6-8 hours roundtrip",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 5,
      "crowdFactor": 2,
      "park": "Yosemite National Park"
    },
    {
      "id": 3,
      "name": "The Mist Trail (Vernal and Nevada Falls)",
      "coords": {
        "latitude": 37.7268707,
        "longitude": -119.5454392
      },
      "distance": "3 miles round trip to Vernal Fall, 7 miles round trip to Nevada Fall.",
      "difficulty": "moderate",
      "familyFriendly": true,
      "elevationGain": "1900 ft",
      "campground": false,
      "whyVisit": "This is Yosemite's signature hike. While many of Yosemite's trails are popular due to having a single spectacular destination, the Mist Trail has fabulous views scattered all along it, beginning at the bridge overlook, progressing to two unforgettable waterfalls that fall a combined total of more than 900 feet (270 meters), and ending with perhaps the most striking of all: the view of Nevada Fall, Liberty Cap, and the back of Half Dome from the Muir Trail return segment.",
      "description": "After a brief stroll along the river, you climb a pretty steep initial accent until you reach the footbridge, which offers the first glimpse of Vernal Fall in the distance (and a water-fountain and restrooms).  You will then continue up to Vernal Fall, past Emerald Pool, and alongside Nevada Fall until you reach the high-point for this hike.Then take the alternate route down along the John Muir Trail to see views of Nevada Fall and Liberty Cap in the distance before meeting back up with the Mist Trail near the footbridge. ",
      "hazards": "It's illegal to remove any natural objects from a national park, but everyone who hikes the aptly named Mist Trail in the early season is a scofflaw: it's impossible to hike to the top of Vernal Fall in the spring without taking a little piece of the fall with you. You will get wet. Very wet. Taking-a-shower wet. Jumping-in-the-ocean wet. Bring rain gear.For related reasons, the stone steps carved into the canyon wall beside Vernal Fall can be slippery, so tread carefully.",
      "permit": "none",
      "trailhead": "Happy Isles in eastern Yosemite Valley (shuttle stop #16)",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/mistTrail.jpg",
      "estTime": "2-5 hours depending on how far you go",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 5,
      "crowdFactor": 4,
      "park": "Yosemite National Park"
    },
    {
      "id": 4,
      "name": "Tioga Pass to Mt. Dana",
      "coords": {
        "latitude": 37.8998,
        "longitude": -119.2211
      },
      "distance": "6.0 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "elevationGain": "3064 ft",
      "campground": false,
      "whyVisit": "Mount Dana, at 13,061′, is the second highest peak in Yosemite only shy to Mount Lyell at 13,114′. However, many people agree that the Mount Dana hike offers the better view of the two with amazing views at the crest of the Sierras. This strenuous hike rises almost 3,000′ in just over 3-miles, but is simply one of the best of all Yosemite hiking trails!",
      "description": "A day hike to Mt. Dana, the second highest mountain in Yosemite National Park.Mt. Dana is relatively easily accessible peak and is the second highest in Yosemite National Park (Mt. Lyell is the highest one). The trail head is located right next to the east entrance of the Yosemite National Park. There are no trail markers or maps but there is an unofficial use trail to the top and is pretty easy to follow. The trail starts with an easy walk through the meadows before it starts going up through a series of switchbacks. After about 1.5 miles from the trailhead and about 1,500 feet high, you reach a flat area and the peak comes into sight. You are about half way at that point and the serious climb is about to start.After you walk across the flat area, the trail gets lost in the rocks and you have to follow your instincts and the stone cairn markers and head towards the peak. You will be hiking up loose rock and need to be careful with your footing. Once you reach the top, the views are incredible!",
      "hazards": "Bring plenty of water as there are no places to fill up after the hike through the Dana meadows. Tioga Pass road is generally closed Nov-May and trail conditions due to snow and ice may make this trail difficult even when the trail is open.  Check with park rangers to confirm conditions. Be prepared for the wind and the cold at the top of the mountain. There are some restrooms at the parking lot but no water. So plan accordingly.",
      "permit": "none",
      "trailhead": "Tioga Pass Gate",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/mtDana.jpg",
      "estTime": "3-12 hours depending on how fast you go. This route is known for attracting runners.",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 5,
      "crowdFactor": 4,
      "park": "Yosemite National Park"
    },
    {
      "id": 5,
      "name": "Eagle Peak and Yosemite Falls Extravaganza",
      "coords": {
        "latitude": 37.75550,
        "longitude": -119.6038
      },
      "distance": "11.0 miles roundtrip",
      "difficulty": "strenuous",
      "familyFriendly": false,
      "elevationGain": "3064 ft",
      "campground": false,
      "whyVisit": "Well earned solitude and some of the best views of Yosemite's rock features are the rewards for reaching Eagle Peak. You also get the added bonus of visiting two unforgettable world-class waterfalls along the way. This supreme vantage point makes all the hubbub of Yosemite Valley look like a distant ant colony.",
      "description": "Most park visitors walk to the base of Lower Yosemite Fall. This popular trail gets you to the other end—the brink of Upper Yosemite Fall. For some, the hike is quite strenuous, and many ascend only to Columbia Rock, which is a worthy goal in itself. Strategically located Eagle Peak, highest of the Three Brothers, provides commanding views both up and down Yosemite Valley. The hike to it also provides exciting views, and it is included here as a side trip. Doing this optional extension of Trail 30 will increase your round-trip distance from 7.0 to 12.8 miles and your total elevation gain and descent by about 3000 feet, to 9800 feet.",
      "hazards": "Bring plenty of water and make sure you are in shape!",
      "permit": "none",
      "trailhead": "Yosemite Falls Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/eaglePeak.jpg",
      "estTime": "2-5 hours depending on how far you go",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 5,
      "crowdFactor": 2,
      "park": "Yosemite National Park"
    },
    {
      "id": 6,
      "name": "Pohono Trail",
      "coords": {
        "latitude": 37.7035387,
        "longitude": -119.6635002
      },
      "distance": "13.0 miles one-way, 26 miles round-trip",
      "difficulty": "strenuous",
      "familyFriendly": false,
      "elevationGain": "3700 ft",
      "campground": false,
      "whyVisit": "This east-west hike along Yosemite Valley's south rim, going from Glacier Point to the Tunnel View (or, less frequently, vice versa), is a scenery smorgasbord, passing more points than a pincushion and giving you a bird's-eye view of everything that Yosemite Valley's famous for.",
      "description": "A sockdolager. Along the way you'll pass Glacier, Taft, Dewey, Crocker, Stanford, and Inspiration Points, along with Sentinel Dome and the Tunnel View. You'll have views of all Yosemite Valley's great natural landmarks: Vernal, Nevada, Yosemite, and Bridalveil Falls; Half Dome, Sentinel and Cathedral Rocks, El Capitan, and more. You will have to slog through a less thrilling 4-mile stretch between Dewey and Taft Points where the trail veers away from the valley rim, though, and you'll only have intermittent glimpses of the valley between the various viewpoints.",
      "hazards": "There are people out there who can do the Pohono Trail round trip in a single day. They're too busy training for the Badwater Ultramarathon on their robotic legs to read this, though, so let's just assume you're doing the trail one way, in which case you're going to need transportation to your chosen trailhead at either the beginning or the end of the hike. Unfortunately, this may be the most complicated part of hiking the Pohono Trail. There are three main options: to provide your own transportation, to take the Glacier Point tour bus to Glacier Point and hike back down, or to hike up to Glacier Point and then take the tour bus back down.",
      "permit": "none",
      "trailhead": "Yosemite Falls Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/pohonoTrail.jpg",
      "estTime": "5-10 hours one-way",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 4,
      "crowdFactor": 3,
      "park": "Yosemite National Park"
    },
    {
      "id": 7,
      "name": "Tamarack and Cascade Creek",
      "coords": {
        "latitude": 37.7268709,
        "longitude": -119.7132264
      },
      "distance": "8.0 miles roundtrip",
      "difficulty": "moderate",
      "familyFriendly": true,
      "elevationGain": "1418 ft",
      "campground": false,
      "whyVisit": "This is the run for you if you're partial to big views, wildflowers, creek wading, and birding. The other main feature of this trail is solitude, quiet, and more wilderness than you're likely to get in the Valley.",
      "description": "From the Big Oak Flat parking area, switchback steeply up through scrubby terrain with views of Half Dome and El Capitan. This area was burned by wildfires in 1990, and today zillions of little trees have sprouted back up. The fires also opened up the understory to sunlight allowing wildflowers to thrive here. Birds also appreciated the new habitat and moved in, keeping the birdwatchers happy. Cross several inlets of Wildcat Creek as the trail descends and then climbs back up the more wooded hillside. Enter a small ravine formed by Tamarack Creek. Crossing this water can be impossible in early season, even well into June. Continue to contour around the hillside, ascending a handful of steeper sections before reaching the Old Big Oak Flat dirt road (now closed to vehicles). The small pools here in Cascade Creek are good for wading and make pretty backdrops for picnics. The turnaround point for this trail is the Cascade Bridge where the Tamarack Creek Trail and Coyote Creek arrive from the west. Once you've seen enough wildflowers and wildlife to tide you over to your next visit, retrace your steps back to the parking area.",
      "hazards": "The grades on this trail aren't too difficult and there are some great areas along the creek to picnic. You can make this as long or as short of an out and back hike as the kids would like.",
      "permit": "none",
      "trailhead": "Old Big Oak Flat",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/tamarackCreek.jpg",
      "estTime": "4-5 hours",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 4,
      "crowdFactor": 1,
      "park": "Yosemite National Park"
    },
    {
      "id": 8,
      "name": "Lyell Canyon",
      "coords": {
        "latitude": 37.8641,
        "longitude": -119.3018
      },
      "distance": "1.4 miles to 24 miles roundtrip, depending on how ambitious you are",
      "difficulty": "easy-moderate",
      "familyFriendly": true,
      "campground": false,
      "elevationGain": "less than 100 ft in first 8 miles, 2500 feet if you go all the way to Donohue Pass",
      "whyVisit": "Maybe you're a descendant of the eminent English geologist Charles Lyell, who lived long enough to have a canyon named after him and make all those years of looking at rocks worthwhile. Maybe you'd like to mingle with through-hikers on the Pacific Crest Trail, of which the Lyell Canyon trail is a part, and find out whether you really can smell them before you see them. Or maybe you'd just like a pleasant, if unspectacular, hike through the woods, with a few bridges and river crossings (which may sound redundant, but the latter don't always come with the former in Yosemite).",
      "description": "The first fork occurs just a few hundred meters past the trailhead, if you're taking the trailhead  from the Tuolumne Meadows Lodge parking lot. The left fork takes a bridge across the Dana Fork of the Tuolumne River, and the right fork continues ahead along its southern bank. Take the left fork and cross the river here. Not only is it more interesting looking, but it's the right trail, too.You'll pass three more forks within the first two miles of the trail. To address them with the sort of concision that your valuable time deserves: take this fork instead of this one; this one instead of this one; and this one instead of this one. In general, if a sign says Lyell Canyon or Donohue Pass on it, it's the right way to go. John Muir Trail is also a good indicator. Yet another fork awaits you a little over 5 miles (8 km) into the hike. Stay left to continue through Lyell Canyon to Donohue Pass 7 miles (11 km) ahead; turn right to go to Ireland Lake, 4.3 miles (7 km) distant.",
      "hazards": "TAbout a mile and a half into the hike, just after crossing the bridge over Rafferty Creek, there's another creek crossing with no bridge. It's too wide to leap across during peak runoff, but there's a log crossing. Bringing mosquito repellent is a decision you're not likely to regret. In a not entirely unrelated matter, the meadows along the trail can be marshy early in the summer.",
      "permit": "none",
      "trailhead": "Parking lot of the Tuolumne Meadows Lodge",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/lyellCanyon.jpg",
      "estTime": "4-5 hours",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 4,
      "crowdFactor": 2,
      "park": "Yosemite National Park"
    },
    {
      "id": 9,
      "name": "Grand Canyon of Tuolumne",
      "coords": {
        "latitude": 37.9499200,
        "longitude": -119.7251700
      },
      "distance": "46.8 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "elevationGain": "4550 ft",
      "campground": false,
      "whyVisit": "Hike through one of Yosemite's most breathtaking backcountry river canyons. Traverse the famous Tuolumne River from the high country to the lower valley. Pass several impressive waterfalls and box canyon sections. Follow in the footsteps of John Muir, who pioneered this route in the 1800's. Soak up rejuvenating solitude in remote sections of this hike. Have good potential to see wildlife. Enjoy savings and convenience with included pre-trip dinner and camping. Enjoy our exceptional backcountry cuisine and expert guides",
      "description": "This is a rugged overnight backpack into the North country of Yosemite dropping in from Tuolumne Meadows into the Grand Canyon of the Tuolumne. Done at the beginning of Spring is best due to the high volume of water but be ready for some river fording through some very icy temperatures. It begins at an elevation just under 9,000' and drops to a low elevation of 4,500' almost 19 miles later at Pate Valley. Coming up out of Pate Valley heading towards Harden Lake is an elevation gain of almost 4,550' in just under 8 or so miles, be prepared for some thigh quivering demands. During the hike you'll pass a series of waterfalls starting with White Cascade Falls followed by Tuolumne Falls, California Falls, Le Conte Falls and finally the geological wonder, Waterwhell Falls, where the water flows down over a series of grooves in the rocks that can propel the water close to 20' into the air in a counter clock wise wheel, really spectacular.",
      "hazards": "Bring plenty of water and make sure you are in shape!",
      "permit": "none",
      "trailhead": "Tuolumne Meadows",
      "bestHike": false,
      "backpacking": true,
      "coverImgUrl": "../images/grandCanyon.jpg",
      "estTime": "2-4 days",
      "sceneryFactor": 5,
      "crowdFactor": 2,
      "park": "Yosemite National Park"
    },
    {
      "id": 10,
      "name": "Lower Yosemite Fall Trail",
      "coords": {
        "latitude": 37.751314,
        "longitude": -119.5965547
      },
      "distance": "1 mile loop",
      "difficulty": "easy",
      "campground": false,
      "difficultyExplained": "Call it a 4 out of 10 going down and 7 out of 10 going up. The trail is wide and smooth, and not nearly so steep as Upper Yosemite Falls, whose own valley-floor-to-valley-rim trail is a mile shorter. By the time you finish the second set of switchbacks on the way up, though, you'll know you've been on a hike",
      "bestTime": "Yosemite Falls is a big factor in the scenery here, and it looks best in the spring, when snowmelt is at its peak. The view looking west to Cathedral Rocks and El Capitan tends to get hazy some days (especially noticeable if you're photographing it), and will be better if you can do it on a clear day or early in the morning. There's enough to see here, though, that the trail's enjoyable any time it's open. (Note that it's usually closed in the winter, and might not open in the spring until the Glacier Point Road opens, generally in May - see the park service's Wilderness Conditions Trail Update page to see if it's listed among the currently closed trails.)",
      "familyFriendly": true,
      "elevationGain": "75 ft",
      "whyVisit": "Part of North America's tallest waterfall, Lower Yosemite Fall is the final 320-foot (98-meter) drop. Deafening in spring and early summer when the waterfall peaks in volume, you can expect to get sprayed with water when standing on the footbridge near its base. This short, easy walk rewards with spectacular views of both Upper and Lower Yosemite Falls. This paved loop trail offers different vantage points of Yosemite Falls and Yosemite Creek, and you can stop at the many exhibits to learn more about the natural and cultural history of the area",
      "description": "The trail to Lower Yosemite Fall is open year-round. When the water is at its peak in spring and early summer, you can expect to get a little wet. This waterfall is often dry from late July or August through October. Expect icy conditions in some areas during the winter, especially on the short climb leading to the footbridge on the western trail.",
      "hazards": "Stay on the paved trail. Above the wooden footbridge that crosses Yosemite Creek, the rocks and boulders are slippery even when dry. Scrambling off-trail in this area has led to serious injuries",
      "permit": "none",
      "bestHike": false,
      "backpacking": false,
      "trailhead": "Lower Yosemite Fall Trailhead (shuttle stop #6)",
      "coverImgUrl": "../images/lowerYosemiteFalls.jpg",
      "estTime": "30 minutes",
      "sceneryFactor": 5,
      "crowdFactor": 5,
      "park": "Yosemite National Park"
    },
    {
      "id": 11,
      "name": "Bridalveil Fall",
      "coords": {
        "latitude": 37.7167,
        "longitude": -119.6464
      },
      "distance": " 1.2 mile roundtrip",
      "difficulty": "easy",
      "familyFriendly": true,
      "elevationGain": "200 ft",
      "campground": false,
      "whyVisit": "At 620 feet (189 meters), this cataract is short compared to Yosemite Falls, but chances are you still don't have anything like it in your neighborhood. It's famous for the mist that wafts off it when the breezes blow and which, according to the poetic, isolation-addled souls who get to name waterfalls, resembles a bridal veil. Hanging out at the base of the falls during peak runoff can be akin to taking a shower in a tornado, sans the flying cows.",
      "description": "Bridalveil Fall is often the first waterfall you'll see when entering Yosemite Valley. In spring, it thunders; during the rest of the year, look for its characteristic light, swaying flow. A paved trail leads from the parking area to the base of this waterfall, which flows year-round. Although paved, this is trail is not wheelchair accessible due to its grade.",
      "hazards": "The rocks and boulders above the viewing platform are slippery even when dry; stay safe by staying on the paved trail. Scrambling off trail in this area has led to serious injuries. If you choose to park along Southside Drive, when getting out of your vehicle, watch for traffic and be cautious opening car doors and crossing the road.",
      "permit": "none",
      "bestHike": false,
      "backpacking": false,
      "trailhead": "Bridalveil Falls parking lot",
      "coverImgUrl": "../images/bridalveilFalls.jpg",
      "estTime": "15-30 minutes",
      "sceneryFactor": 4,
      "crowdFactor": 5,
      "park": "Yosemite National Park"
    }
  ]
}