{
  "trails": [
    {
      "id": 0,
      "name": "Highline Trail",
      "coords": {
        "latitude": 48.696343,
        "longitude": -113.717601
      },
      "distance": "11.8 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "campground": false,
      "elevationGain": "1950 ft",
      "whyVisit": "Rarely does a trail deliver as many breathtaking views as Highline Trail in Glacier National Park. This is one of the most incredible day hikes in Glacier (and therefore anywhere on the planet). Highline Trail begins on the Continental Divide, delivering lofty views right from the start. Things are pretty level for the first three miles, making it easy for less ambitious hikers to still snag some great views.",
      "description": "Find the trailhead at Logan Pass, just across Going-to-the-Sun Road from the park visitor center, Highline Trail shoots north along a cliff on the western side of the Continental Divide. The trail is carved into a sheer rock face known as the Garden Wall. Below the trail there is a vertical drop to Going-to-the-Sun Road, which progresses down the mountain from Logan Pass to Lake McDonald. The trail is wide enough for hikers to pass in both directions, and there is a chain to hold on to through a precarious stretch near the start of the hike. Highline Trail is not recommended for small children and those with a fear of heights. Keep and eye out for wildlife. The Garden Wall is a favorite environment for mountain goats and bighorn sheep.",
      "hazards": "Highline Trail begins a steady descent and Granite Park Chalet eventually comes into view. The pitched-roof stone shelter provides backcountry accommodations and even sells water and snacks. About 3/4 of a mile before the chalet, you will come to a junction on the right with Garden Wall Trail. This is the first marked junction on the hike, a steep spur that tackles a thousand-foot climb in one mile to reach Glacier Overlook. The rocky track is unapologetically strenuous, but it rewards the effort with a view unlike anything on Highline Trail, an eastward vantage over Grinnell Glacier, which spills into Grinnell Lake and a string of turquoise lakes in the Many Glacier region of Glacier National Park. Are you up for it?",
      "permit": "none",
      "trailhead": "Logan Pass",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/highlineTrail.jpg",
      "estTime": "10-14 hours",
      "sceneryFactor": 5,
      "crowdFactor": 5,
      "park": "Glacier National Park"
    },
    {
      "id": 1,
      "name": "Swiftcurrent Pass",
      "coords": {
        "latitude": 48.7783,
        "longitude": -113.7643
      },
      "distance": "14.2 miles roundtrip",
      "difficulty": "strenuous",
      "familyFriendly": false,
      "elevationGain": "2400 ft",
      "campground": false,
      "whyVisit": "The Swiftcurrent Pass Trail in Glacier National Park takes hikers through the middle of the incredible Swiftcurrent Valley and up to the continental divide, and is one of the most diverse trails in Glacier Park. This diversity makes the Swiftcurrent Pass Trail suitable for all ages and hiking abilities, depending on how far the hiker chooses to go.  There are basically three sections of this hike, the first being the least strenuous and the last section being the most strenuous...",
      "description": "If you want to REALLY get a workout, you can hike on a trail that takes you all the way to the summit of Swiftcurrent Mountain, which is another 1,000 vertical foot climb in just over 2 miles!If you don't want to hike to the summit of Swiftcurrent Mountain, you have the option of either heading back to the trailhead at the Swiftcurrent Motor Inn parking lot, or keep going another mile to the iconic Granite Park Chalet which is located on the west side of the continental divide.The beauty of the Swiftcurrent Pass Trail is that you can choose how far you want to go and how hard you want to work.  It truly is a trail that varies from being extremely easy to extremely strenuous, and you can decide what level you want to pursue. ",
      "hazards": "Start your hike early; this trail can become very hot mid-day. By starting as early as possible, you will be able to spend more of the hike in shade and less in the sun. Stay on the trail and resist the temptation to cut switchbacks. Cutting switchbacks is illegal, and there are many drop-offs and ledges hidden by brush.Sprained ankles are common on this trail. It is partially paved and has loose sand on top, which makes for slippery footing in places.",
      "permit": "none",
      "trailhead": "Swiftcurrent Pass Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/swiftcurrentPass.jpeg",
      "estTime": "10-14 hours roundtrip",
      "sceneryFactor": 5,
      "crowdFactor": 4,
      "park": "Glacier National Park"
    },
    {
      "id": 2,
      "name": "Siyeh Pass Loop",
      "coords": {
        "latitude": 48.71674,
        "longitude": -113.61331
      },
      "distance": "10.4 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "elevationGain": "2280 ft",
      "campground": false,
      "whyVisit": "The Siyeh Pass loop in Glacier National Park is one of the park's best trails for day trips. In fact, I would argue that no other trail (remember, for day trips) offers as much. Over the course of about 10.5 miles, you get all of the following and more: a high pass, mountain views, glaciers, gem-like tarns, tundra slopes, wildflower meadows, waterfalls, rushing streams, a spectacular gorge enclosed by red cliffs, and outstanding wildlife habitat. And although it's not a secret and you will probably see many other people, this loop doesn't see anywhere close to the traffic that the Hidden Lake and Highline trails, both originating from nearby Logan Pass, do.",
      "description": "The trail begins at the Piegan Pass trailhead at Siyeh Bend, climbs up through stands of subalpine fir and spruce, then crosses Preston Park and zigzags up the rocky talus slope of Matahpi to Siyeh Pass, then descends through the Baring Creek valley with St. Mary Lake in the distance. Or, for a longer more strenuous hike reverse the route, beginning at Sun Rift Gorge. After a short steep climb above Sun Rift Gorge, the trail opens into the breathtaking Baring Creek valley with Going-to-the-Sun Mountain towering above the trail as it parallels the creek ,climbing through lovely red rock formations. Alongside, the creek forms alternating cascades and pools. After leaving the creek, the trail works through a prolific huckleberry patch and then traverses Goat Mountain's flank to the head of the valley. A series of steep switchbacks ascend to the col, the trail winds around Matahpi's shoulder, and then descends over Siyeh Pass into Preston Park.",
      "hazards": "Under normal conditions, you just need enough food and water to last 5-6 hours. But... The area around Siyeh Pass, especially to its south, is marked as one of the snow hazard areas in the park. This means that in June and into July, having an ice axe and perhaps crampons as well is in order. It is advisable to go to the closest ranger station and find out about current conditions before you set out at those times of the year. And...This is grizzly country. Rules are different. If you don't know them, do yourself and the bears a favor by staying in your car or hiking the tourist-clogged trails that originate at Logan Pass.",
      "permit": "none",
      "trailhead": "Siyeh Bend",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/siyehPass.jpg",
      "estTime": "7-10 hours roundtrip",
      "sceneryFactor": 5,
      "crowdFactor": 2,
      "park": "Glacier National Park"
    },
    {
      "id": 3,
      "name": "Piegan Pass",
      "coords": {
        "latitude": 48.71043,
        "longitude": -113.68934
      },
      "distance": "9.2 miles roudtrip",
      "difficulty": "difficult",
      "familyFriendly": true,
      "elevationGain": "1850 ft",
      "campground": false,
      "whyVisit": "The hike to Piegan Pass is among our favorite Glacier Park hikes, and is very popular for those who love hiking mountainous areas in Glacier National Park.  The views the entire way along this well known Glacier Park hike are wonderful, which make this hike in Glacier Park well worth the time and effort.  On your way to Piegan Pass, the Piegan Pass Trail in Glacier Park will climb 1,670 vertical feet, which is regarded as an average amount of vertical gain, especially with a mountain pass involved. Piegan Pass itself is 7,560 feet above sea level, which is quite high, thus allowing for terrific views all around.",
      "description": "As you reach Piegan Pass (elevation 7,560 feet) during this wonderful Glacier Park hike, the Garden Wall becomes a breathtaking sight that dominates the view to the northwest.  To the southwest, you will see the broad alpine slopes that make up the Piegan Saddle that is situated between Piegan Mountain and Pollock Mountain.  The Garden Wall is attached to the north side of Pollock Mountain, and as this great wall heads northward, it eventually connects with the iconic Mount Gould, which is the major feature in the distance to the north, looming above Cataract Creek Valley. This large valley is where the Piegan Pass Trail continues onward until it eventually reaches the historic Many Glacier Hotel to the north, which is located out of view at the far end of this Cataract Creek drainage.",
      "hazards": "Possible Snow Fields. This open slope often has snow fields on it early in the season, so be prepared for this.  We recommend that you use traction devices on your boots, such as YakTrax or something similar, especially if the snow fields are icy early in the morning.  Snow fields can be really dangerous, so be really careful.",
      "permit": "none",
      "trailhead": "Piegan Pass Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/pieganPass.jpg",
      "estTime": "7-9 hours depending on how far you go",
      "sceneryFactor": 4,
      "crowdFactor": 2,
      "park": "Glacier National Park"
    },
    {
      "id": 4,
      "name": "Ptarmigan Tunnel",
      "coords": {
        "latitude": 48.8496,
        "longitude": -113.7077
      },
      "distance": "10.7 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "elevationGain": "2300 ft",
      "campground": false,
      "whyVisit": "Ptarmigan Tunnel Trail is one of those trails that I will hike again and again. It is a tough trail, but it is worth it. Words cannot express the feeling you get after coming out of tunnel into the Belly River Valley.",
      "description": "Ptarmigan Tunnel Trail shares the first half of it's trail with the Iceberg Lake Trail. Iceberg Lake Trail is a heavily traveled trail with a moderate ascent, Ptarmigan Tunnel Trail after the split from Iceberg Lake Trail, starts going up! Eventually you arrive at Ptarmigan Lake located at the base of Ptarmigan Wall. Before the trail reaches Ptarmigan Lake it comes to a series of small, scenic falls. If you are lucky the shoreline will be covered with wildflowers. The lake is a good place to rest as the next part of the trail is up a steep scree slope. Big Horn Sheep can often be seen on these slopes. the first time I hiked to Ptarmigan Tunnel there were Big Horn ewes on the slope, luckily I made it to the far side of the tunnel before a small group on horseback made it to the tunnel. This was actually the first time that I had encountered a private group on horseback in Glacier Park. In Yellowstone it is a fairly common occurrence. There can be snow cover in late July on this trail. From Ptarmigan Lake the trail starts up a series of switch backs on a scree slope. I was unable to see the tunnel from the lake, your eyes may be better then mine. The first time I did this trail I was very lucky to have several able body hikers, including my future son-in-law who had just climbed Denali. Once again I was carrying too much camera gear, so I grabbed onto my son-in-law's backpack when we got to the scree slope. When it got really bad one of my daughters would push while he pulled. It was worth the effort! From Ptarmigan Lake to the tunnel is a mass of broken rock that has over the centuries flaked off Ptarmigan Wall forming a talus slope. After passing through the tunnel you are on a trail which was carved out of the side of the mountain, providing your first view of the Belly River Valley and Elizabeth Lake. After walking down the trail from the tunnel a short distance you can see the Old Sun Glacier off to the northwest.",
      "hazards": "You are entering a wilderness area and must accept certain inherent dangers, including snow, steep terrain, water and wildlife. There is no guarantee of your safety.",
      "permit": "none",
      "trailhead": "Tioga Pass Gate",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/ptarmiganTunnel.jpeg",
      "estTime": "7-10 hours",
      "sceneryFactor": 5,
      "crowdFactor": 4,
      "park": "Glacier National Park"
    },
    {
      "id": 5,
      "name": "Apgar Lookout Trail",
      "coords": {
        "latitude": 48.51806,
        "longitude": -114.01972
      },
      "distance": "7.1 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": true,
      "elevationGain": "1845 ft",
      "campground": false,
      "whyVisit": "The Apgar Lookout Trail provides a beautiful and unique view into Glacier National Park. Apgar Lookout sits atop Apgar Mountain, which lies at the outlet of Lake McDonald and just outside West Glacier, Montana. From atop the mountain at the lookout, a visitor gets a nearly unobstructed view down on Lake McDonald and a stunning view of the high peaks in Glacier National Park.",
      "description": "The hike up to Apgar Lookout is fairly short, only 2.8 miles, but has a pretty steady and at times steep vertical descent. Except for at a few places along the trial, the Apgar Lookout Trail passes through heavily wooded terrain (now burnt over!), offering only limited views. However, once at the lookout, the stunning and unique view of Lake McDonald (Lake McDonald looks like a pond sitting in a massive and beautiful bathtub) makes the hike more than worthwhile.",
      "hazards": "Bring plenty of water and make sure you are in shape!",
      "permit": "none",
      "trailhead": "Yosemite Falls Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/apgarLookout.jpg",
      "estTime": "5-6 hours",
      "sceneryFactor": 4,
      "crowdFactor": 3,
      "park": "Glacier National Park"
    },
    {
      "id": 6,
      "name": "Redrock Falls",
      "coords": {
        "latitude": 37.7035387,
        "longitude": -119.6635002
      },
      "distance": "4.2 miles round-trip",
      "difficulty": "easy",
      "familyFriendly": true,
      "elevationGain": "285 ft",
      "campground": false,
      "whyVisit": "This east-west hike along Yosemite Valley's south rim, going from Glacier Point to the Tunnel View (or, less frequently, vice versa), is a scenery smorgasbord, passing more points than a pincushion and giving you a bird's-eye view of everything that Yosemite Valley's famous for.",
      "description": "A sockdolager. Along the way you'll pass Glacier, Taft, Dewey, Crocker, Stanford, and Inspiration Points, along with Sentinel Dome and the Tunnel View. You'll have views of all Yosemite Valley's great natural landmarks: Vernal, Nevada, Yosemite, and Bridalveil Falls; Half Dome, Sentinel and Cathedral Rocks, El Capitan, and more. You will have to slog through a less thrilling 4-mile stretch between Dewey and Taft Points where the trail veers away from the valley rim, though, and you'll only have intermittent glimpses of the valley between the various viewpoints.",
      "hazards": "There are people out there who can do the Pohono Trail round trip in a single day. They're too busy training for the Badwater Ultramarathon on their robotic legs to read this, though, so let's just assume you're doing the trail one way, in which case you're going to need transportation to your chosen trailhead at either the beginning or the end of the hike. Unfortunately, this may be the most complicated part of hiking the Pohono Trail. There are three main options: to provide your own transportation, to take the Glacier Point tour bus to Glacier Point and hike back down, or to hike up to Glacier Point and then take the tour bus back down.",
      "permit": "none",
      "trailhead": "Swiftcurrent Pass Trailhead",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/redrockFalls.jpg",
      "estTime": "5-10 hours one-way",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 4,
      "crowdFactor": 3,
      "park": "Yosemite National Park"
    },
    {
      "id": 7,
      "name": "Tamarack and Cascade Creek",
      "coords": {
        "latitude": 37.7268709,
        "longitude": -119.7132264
      },
      "distance": "8.0 miles roundtrip",
      "difficulty": "moderate",
      "familyFriendly": true,
      "elevationGain": "1418 ft",
      "campground": false,
      "whyVisit": "This is the run for you if you're partial to big views, wildflowers, creek wading, and birding. The other main feature of this trail is solitude, quiet, and more wilderness than you're likely to get in the Valley.",
      "description": "From the Big Oak Flat parking area, switchback steeply up through scrubby terrain with views of Half Dome and El Capitan. This area was burned by wildfires in 1990, and today zillions of little trees have sprouted back up. The fires also opened up the understory to sunlight allowing wildflowers to thrive here. Birds also appreciated the new habitat and moved in, keeping the birdwatchers happy. Cross several inlets of Wildcat Creek as the trail descends and then climbs back up the more wooded hillside. Enter a small ravine formed by Tamarack Creek. Crossing this water can be impossible in early season, even well into June. Continue to contour around the hillside, ascending a handful of steeper sections before reaching the Old Big Oak Flat dirt road (now closed to vehicles). The small pools here in Cascade Creek are good for wading and make pretty backdrops for picnics. The turnaround point for this trail is the Cascade Bridge where the Tamarack Creek Trail and Coyote Creek arrive from the west. Once you've seen enough wildflowers and wildlife to tide you over to your next visit, retrace your steps back to the parking area.",
      "hazards": "The grades on this trail aren't too difficult and there are some great areas along the creek to picnic. You can make this as long or as short of an out and back hike as the kids would like.",
      "permit": "none",
      "trailhead": "Old Big Oak Flat",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/tamarackCreek.jpg",
      "estTime": "4-5 hours",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 4,
      "crowdFactor": 1,
      "park": "Yosemite National Park"
    },
    {
      "id": 8,
      "name": "Lyell Canyon",
      "coords": {
        "latitude": 37.8641,
        "longitude": -119.3018
      },
      "distance": "1.4 miles to 24 miles roundtrip, depending on how ambitious you are",
      "difficulty": "easy-moderate",
      "familyFriendly": true,
      "campground": false,
      "elevationGain": "less than 100 ft in first 8 miles, 2500 feet if you go all the way to Donohue Pass",
      "whyVisit": "Maybe you're a descendant of the eminent English geologist Charles Lyell, who lived long enough to have a canyon named after him and make all those years of looking at rocks worthwhile. Maybe you'd like to mingle with through-hikers on the Pacific Crest Trail, of which the Lyell Canyon trail is a part, and find out whether you really can smell them before you see them. Or maybe you'd just like a pleasant, if unspectacular, hike through the woods, with a few bridges and river crossings (which may sound redundant, but the latter don't always come with the former in Yosemite).",
      "description": "The first fork occurs just a few hundred meters past the trailhead, if you're taking the trailhead  from the Tuolumne Meadows Lodge parking lot. The left fork takes a bridge across the Dana Fork of the Tuolumne River, and the right fork continues ahead along its southern bank. Take the left fork and cross the river here. Not only is it more interesting looking, but it's the right trail, too.You'll pass three more forks within the first two miles of the trail. To address them with the sort of concision that your valuable time deserves: take this fork instead of this one; this one instead of this one; and this one instead of this one. In general, if a sign says Lyell Canyon or Donohue Pass on it, it's the right way to go. John Muir Trail is also a good indicator. Yet another fork awaits you a little over 5 miles (8 km) into the hike. Stay left to continue through Lyell Canyon to Donohue Pass 7 miles (11 km) ahead; turn right to go to Ireland Lake, 4.3 miles (7 km) distant.",
      "hazards": "TAbout a mile and a half into the hike, just after crossing the bridge over Rafferty Creek, there's another creek crossing with no bridge. It's too wide to leap across during peak runoff, but there's a log crossing. Bringing mosquito repellent is a decision you're not likely to regret. In a not entirely unrelated matter, the meadows along the trail can be marshy early in the summer.",
      "permit": "none",
      "trailhead": "Parking lot of the Tuolumne Meadows Lodge",
      "bestHike": true,
      "backpacking": false,
      "coverImgUrl": "../images/lyellCanyon.jpg",
      "estTime": "4-5 hours",
      "region": "Yosemite Valley",
      "type": "day-hike",
      "sceneryFactor": 4,
      "crowdFactor": 2,
      "park": "Yosemite National Park"
    },
    {
      "id": 9,
      "name": "Grand Canyon of Tuolumne",
      "coords": {
        "latitude": 37.9499200,
        "longitude": -119.7251700
      },
      "distance": "46.8 miles roundtrip",
      "difficulty": "difficult",
      "familyFriendly": false,
      "elevationGain": "4550 ft",
      "campground": false,
      "whyVisit": "Hike through one of Yosemite's most breathtaking backcountry river canyons. Traverse the famous Tuolumne River from the high country to the lower valley. Pass several impressive waterfalls and box canyon sections. Follow in the footsteps of John Muir, who pioneered this route in the 1800's. Soak up rejuvenating solitude in remote sections of this hike. Have good potential to see wildlife. Enjoy savings and convenience with included pre-trip dinner and camping. Enjoy our exceptional backcountry cuisine and expert guides",
      "description": "This is a rugged overnight backpack into the North country of Yosemite dropping in from Tuolumne Meadows into the Grand Canyon of the Tuolumne. Done at the beginning of Spring is best due to the high volume of water but be ready for some river fording through some very icy temperatures. It begins at an elevation just under 9,000' and drops to a low elevation of 4,500' almost 19 miles later at Pate Valley. Coming up out of Pate Valley heading towards Harden Lake is an elevation gain of almost 4,550' in just under 8 or so miles, be prepared for some thigh quivering demands. During the hike you'll pass a series of waterfalls starting with White Cascade Falls followed by Tuolumne Falls, California Falls, Le Conte Falls and finally the geological wonder, Waterwhell Falls, where the water flows down over a series of grooves in the rocks that can propel the water close to 20' into the air in a counter clock wise wheel, really spectacular.",
      "hazards": "Bring plenty of water and make sure you are in shape!",
      "permit": "none",
      "trailhead": "Tuolumne Meadows",
      "bestHike": false,
      "backpacking": true,
      "coverImgUrl": "../images/grandCanyon.jpg",
      "estTime": "2-4 days",
      "sceneryFactor": 5,
      "crowdFactor": 2,
      "park": "Yosemite National Park"
    },
    {
      "id": 10,
      "name": "Lower Yosemite Fall Trail",
      "coords": {
        "latitude": 37.751314,
        "longitude": -119.5965547
      },
      "distance": "1 mile loop",
      "difficulty": "easy",
      "campground": false,
      "difficultyExplained": "Call it a 4 out of 10 going down and 7 out of 10 going up. The trail is wide and smooth, and not nearly so steep as Upper Yosemite Falls, whose own valley-floor-to-valley-rim trail is a mile shorter. By the time you finish the second set of switchbacks on the way up, though, you'll know you've been on a hike",
      "bestTime": "Yosemite Falls is a big factor in the scenery here, and it looks best in the spring, when snowmelt is at its peak. The view looking west to Cathedral Rocks and El Capitan tends to get hazy some days (especially noticeable if you're photographing it), and will be better if you can do it on a clear day or early in the morning. There's enough to see here, though, that the trail's enjoyable any time it's open. (Note that it's usually closed in the winter, and might not open in the spring until the Glacier Point Road opens, generally in May - see the park service's Wilderness Conditions Trail Update page to see if it's listed among the currently closed trails.)",
      "familyFriendly": true,
      "elevationGain": "75 ft",
      "whyVisit": "Part of North America's tallest waterfall, Lower Yosemite Fall is the final 320-foot (98-meter) drop. Deafening in spring and early summer when the waterfall peaks in volume, you can expect to get sprayed with water when standing on the footbridge near its base. This short, easy walk rewards with spectacular views of both Upper and Lower Yosemite Falls. This paved loop trail offers different vantage points of Yosemite Falls and Yosemite Creek, and you can stop at the many exhibits to learn more about the natural and cultural history of the area",
      "description": "The trail to Lower Yosemite Fall is open year-round. When the water is at its peak in spring and early summer, you can expect to get a little wet. This waterfall is often dry from late July or August through October. Expect icy conditions in some areas during the winter, especially on the short climb leading to the footbridge on the western trail.",
      "hazards": "Stay on the paved trail. Above the wooden footbridge that crosses Yosemite Creek, the rocks and boulders are slippery even when dry. Scrambling off-trail in this area has led to serious injuries",
      "permit": "none",
      "bestHike": false,
      "backpacking": false,
      "trailhead": "Lower Yosemite Fall Trailhead (shuttle stop #6)",
      "coverImgUrl": "../images/lowerYosemiteFalls.jpg",
      "estTime": "30 minutes",
      "sceneryFactor": 5,
      "crowdFactor": 5,
      "park": "Yosemite National Park"
    },
    {
      "id": 11,
      "name": "Bridalveil Fall",
      "coords": {
        "latitude": 37.7167,
        "longitude": -119.6464
      },
      "distance": " 1.2 mile roundtrip",
      "difficulty": "easy",
      "familyFriendly": true,
      "elevationGain": "200 ft",
      "campground": false,
      "whyVisit": "At 620 feet (189 meters), this cataract is short compared to Yosemite Falls, but chances are you still don't have anything like it in your neighborhood. It's famous for the mist that wafts off it when the breezes blow and which, according to the poetic, isolation-addled souls who get to name waterfalls, resembles a bridal veil. Hanging out at the base of the falls during peak runoff can be akin to taking a shower in a tornado, sans the flying cows.",
      "description": "Bridalveil Fall is often the first waterfall you'll see when entering Yosemite Valley. In spring, it thunders; during the rest of the year, look for its characteristic light, swaying flow. A paved trail leads from the parking area to the base of this waterfall, which flows year-round. Although paved, this is trail is not wheelchair accessible due to its grade.",
      "hazards": "The rocks and boulders above the viewing platform are slippery even when dry; stay safe by staying on the paved trail. Scrambling off trail in this area has led to serious injuries. If you choose to park along Southside Drive, when getting out of your vehicle, watch for traffic and be cautious opening car doors and crossing the road.",
      "permit": "none",
      "bestHike": false,
      "backpacking": false,
      "trailhead": "Bridalveil Falls parking lot",
      "coverImgUrl": "../images/bridalveilFalls.jpg",
      "estTime": "15-30 minutes",
      "sceneryFactor": 4,
      "crowdFactor": 5,
      "park": "Yosemite National Park"
    }
  ]
}